app/controllers/sessions_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."email" = ? LIMIT ?  [["email", "bec@difede.com"], ["LIMIT", 1]]
---
	def create
		@user = User.find_by(:email => params[:session][:email])