app/controllers/users_controller.rb

	def create
		@user = User.new(user_params)
		if @user.save
---
INSERT INTO "users" ("email", "password_digest", "name") VALUES (?, ?, ?)  [["email", "j@email.com"], ["password_digest", "$2a$10$PTu5G3LiWLEvamODI5V0K.A8rJUdR.OZoM/oLhhSii9VjDZJ64Jzi"], ["name", "julie"]]

	def show
		@user = User.find(params[:id])
		@favejobs = Favejob.where(:user_id => @user)
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT "favejobs"."id" FROM "favejobs" WHERE "favejobs"."user_id" = 1